-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Aug 17, 2020 at 03:23 PM
-- Server version: 10.4.13-MariaDB
-- PHP Version: 7.4.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `institute`
--

-- --------------------------------------------------------

--
-- Table structure for table `about`
--

CREATE TABLE `about` (
  `id` int(11) NOT NULL,
  `title` varchar(256) NOT NULL,
  `text` varchar(3000) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `about`
--

INSERT INTO `about` (`id`, `title`, `text`, `img`) VALUES
(1, 'عن المعهد', 'أنشئ المعهد العاالي للهندسة في 18/10/1994 ، بموجب القرار الوزاري رقم 1484 ، و تم بدء النشاط التعليمي في العام الدراسي 1994/1995. يخضع المعهد العالى للهندسة بمدينة السادس من أكتوبر لأحكام القانون رقم 52 لسنة 1970 فى شأن تنظيم المعاهد العالية الخاصة واللائحة الصادرة بالقرار رقم 1088 لسنة 1987. ونظراللحاجة الماسة الى مستوى متميز من المعارف والمهارات والتى تؤهل صاحبها الى دخول سوق العمل الذى يتسم بالمنافسة الشديدة ، فإن المعهد العالي للهندسة يعمل من خلال أقسامه العلمية التى تغطى معظم التخصصات على استيعاب التكنولوجيا الحديثة وتطوير نظم التعليم لتواكب التطورات العالمية المستمرة. يقع المعهد في مدينة الثقافة و العلوم في قلب مدينة السادس من أكتوبر، و على بعد 25 كم من العاصمة ، و تربط مدينة السادس من أكتوبر بالقاهرة عدة طرق و محاور رئيسية ، مما يسهل الوصول الى المعهد أو الخروج منه.', '753293125303.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `aboutcivil`
--

CREATE TABLE `aboutcivil` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `aboutcivil`
--

INSERT INTO `aboutcivil` (`id`, `text`, `img`) VALUES
(1, 'يشرفني أن أرحب بكم باسمي ونيابة عن زملائي من أعضاء هيئة التدريس في قسم الهندسة المدنية.\r\nويسعدني القول بان الهيئة التدريسية تعمل بروح الفريق ولا تبخل بالعطاء في إرشاد الطالب وتوجيهه والأخذ بيده طيلة فترة دراسته .\r\nفرسالة القسم تنبع من رؤية المعهد ورسالته وإستراتيجيته الهادفة إلى خدمة المجتمع في تخريج أجيال متميزة وبكفاءة علمية عالية قادرة على مواجهة المستقبل وتلبية متطلبات سوق العمل كما وتتمتع بروح الولاء والانتماء إلى مجتمعها ووطنها وأمتها.', '3158158185867.png');

-- --------------------------------------------------------

--
-- Table structure for table `aboutcom`
--

CREATE TABLE `aboutcom` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `aboutcom`
--

INSERT INTO `aboutcom` (`id`, `text`, `img`) VALUES
(1, 'يشرفني أن أرحب بكم باسمي ونيابة عن زملائي من أعضاء هيئة التدريس في قسم الهندسة المدنية.\r\nويسعدني القول بان الهيئة التدريسية تعمل بروح الفريق ولا تبخل بالعطاء في إرشاد الطالب وتوجيهه والأخذ بيده طيلة فترة دراسته .\r\nفرسالة القسم تنبع من رؤية المعهد ورسالته وإستراتيجيته الهادفة إلى خدمة المجتمع في تخريج أجيال متميزة وبكفاءة علمية عالية قادرة على مواجهة المستقبل وتلبية متطلبات سوق العمل كما وتتمتع بروح الولاء والانتماء إلى مجتمعها ووطنها وأمتها.', '2354838193956.png');

-- --------------------------------------------------------

--
-- Table structure for table `aboutind`
--

CREATE TABLE `aboutind` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `aboutind`
--

INSERT INTO `aboutind` (`id`, `text`, `img`) VALUES
(1, 'يشرفني أن أرحب بكم باسمي ونيابة عن زملائي من أعضاء هيئة التدريس في قسم الهندسة المدنية.\r\nويسعدني القول بان الهيئة التدريسية تعمل بروح الفريق ولا تبخل بالعطاء في إرشاد الطالب وتوجيهه والأخذ بيده طيلة فترة دراسته .\r\nفرسالة القسم تنبع من رؤية المعهد ورسالته وإستراتيجيته الهادفة إلى خدمة المجتمع في تخريج أجيال متميزة وبكفاءة علمية عالية قادرة على مواجهة المستقبل وتلبية متطلبات سوق العمل كما وتتمتع بروح الولاء والانتماء إلى مجتمعها ووطنها وأمتها.', '8881024054429.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `aboutmech`
--

CREATE TABLE `aboutmech` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `aboutmech`
--

INSERT INTO `aboutmech` (`id`, `text`, `img`) VALUES
(1, 'يشرفني أن أرحب بكم باسمي ونيابة عن زملائي من أعضاء هيئة التدريس في قسم الهندسة المدنية.\r\nويسعدني القول بان الهيئة التدريسية تعمل بروح الفريق ولا تبخل بالعطاء في إرشاد الطالب وتوجيهه والأخذ بيده طيلة فترة دراسته .\r\nفرسالة القسم تنبع من رؤية المعهد ورسالته وإستراتيجيته الهادفة إلى خدمة المجتمع في تخريج أجيال متميزة وبكفاءة علمية عالية قادرة على مواجهة المستقبل وتلبية متطلبات سوق العمل كما وتتمتع بروح الولاء والانتماء إلى مجتمعها ووطنها وأمتها.', '6489185029367.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `activity`
--

CREATE TABLE `activity` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL,
  `date` date NOT NULL,
  `dateyear` varchar(256) NOT NULL,
  `datemonth` varchar(256) NOT NULL,
  `dateday` varchar(256) NOT NULL,
  `timeday` timestamp NOT NULL DEFAULT current_timestamp(),
  `statue` int(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `activity`
--

INSERT INTO `activity` (`id`, `text`, `img`, `date`, `dateyear`, `datemonth`, `dateday`, `timeday`, `statue`) VALUES
(23, 'انتخابات اتحاد الطلاب', 'student1.png', '2020-08-16', '2020', 'August', '16', '2020-08-16 19:54:01', 1),
(24, 'طلاب المعهد العالي للهندسة في مستشفي57357', '4558551478744.jpg', '2020-08-16', '2020', 'August', '16', '2020-08-16 19:55:22', 1),
(25, 'المشاركة في اليوم الخيري للايتام', '1711485887476.jpeg', '2020-08-16', '2020', 'August', '16', '2020-08-16 19:57:48', 1);

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `email` varchar(256) NOT NULL,
  `password` longtext NOT NULL,
  `statue` int(1) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`id`, `name`, `email`, `password`, `statue`, `img`) VALUES
(40, 'Mahmoud Nasr', 'mmmnnn2016161515@gmail.com', '$2y$10$4dMf0XanEFlo4dq8ZxYKxumqbenYW1MG3BOMigkyBHqcfLjDEo2AC', 0, '6854378574441.jpeg'),
(48, 'Ahmed Nasr', 'mmmaaa2016161515@gmail.com', '$2y$10$o5mVdOpyrwIYj8j/QQX.a.gCSJKxpcNsLymEwmLVj9ZTI7mcUtce2', 0, '7836120168871.png'),
(60, 'Mohamed Nasr', 'mmmnnn201616@gmail.com', '$2y$10$kO3UcEEEA3rOPiqzrt72y./uKXtXiIin.Pud6ffQR1bsGYNnVDhDe', 1, 'user1.png');

-- --------------------------------------------------------

--
-- Table structure for table `civilmessage`
--

CREATE TABLE `civilmessage` (
  `id` int(11) NOT NULL,
  `version` longtext NOT NULL,
  `message` longtext NOT NULL,
  `aims` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `civilmessage`
--

INSERT INTO `civilmessage` (`id`, `version`, `message`, `aims`) VALUES
(1, 'أن يكون القسم قادرا على أمداد المجتمع بمهندسين لديهم القدرة على مواكبة التطورات و مواجهة التحديات المرتبطة بالمجالات الهندسية المدنية المتعددة.', 'أن يقدم القسم المناهج الهندسية المواكبة للتطور محليا وإقليميا لخدمة المجتمع وقفا للمعاير المحلية للجودة هذا بالإضافة إلى تحقيق التميز في جودة واستدامة إعمال الهندسة المدنية بتدريب الطلاب ميدانا ومعمليا وكذلك خدمه المجتمع من خلال المساهمة في التبادل المعرفي والأنشطة المهنية وحل المشكلات البيئية المحلية من خلال مشروعات التخرج للطلاب.', '- إعداد خريج قادر على تطبيق العلوم الهندسية وأساليبها في الحياة العملية، قادر على اتخاذ القرار والتعامل مع الأزمات، متمرس بوسائل التكنولوجيا الحديثة وكيفية التعامل معها، وقادر على المنافسة في سوق العمل في ظل الظروف الجديدة والمتغيرة للمجتمع الدولي.\r\n\r\n- المساهمة في إعداد الكوادر الفنية المتخصصة في مختلف المجالات التي تقابل احتياجات المجتمع وتتطلبها مجالات التنمية الشاملة وتوفير المؤهلين في التخصصات الجديدة والمستحدثة التي يتطلبها سوق العمل.\r\n\r\n- توفير تعليم متميز يساهم في إعداد العلماء والمفكرين والمبدعين الذين يمثلون الثروة الحقيقية لتقدم المجتمع.\r\n\r\n- التطوير المستمر للبرامج الدراسية لمواكبة التقدم العلمي والتكنولوجي.\r\n\r\n-إجراء البحوث والدراسات العلمية والتطبيقية التي ترتبط بمشكلات المجتمع وبرامج التنمية في مصر.\r\n\r\n- تقديم الخبرات الاستشارية للهيئات والمؤسسات الإنتاجية وقطاع الخدمات من أجل خدمة البيئة وتنمية المجتمع.\r\n\r\n- دعم وتوثيق الروابط الثقافية والعلمية مع المؤسسات العلمية وكليات الهندسة محليا ودوليا.');

-- --------------------------------------------------------

--
-- Table structure for table `civiltable`
--

CREATE TABLE `civiltable` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `civiltable`
--

INSERT INTO `civiltable` (`id`, `text`, `img`) VALUES
(20, 'جدول امتحانات الترم الاول', '5277355732637.zip'),
(22, 'جدول امتحانات الترم الثاني', '3663668001664.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `comment_id` int(11) NOT NULL,
  `comment_subject` varchar(250) NOT NULL,
  `comment_text` text NOT NULL,
  `comment_status` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- --------------------------------------------------------

--
-- Table structure for table `commessage`
--

CREATE TABLE `commessage` (
  `id` int(11) NOT NULL,
  `version` longtext NOT NULL,
  `message` longtext NOT NULL,
  `aims` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `commessage`
--

INSERT INTO `commessage` (`id`, `version`, `message`, `aims`) VALUES
(1, 'أن يكون القسم قادرا على أمداد المجتمع بمهندسين لديهم القدرة على مواكبة التطورات و مواجهة التحديات المرتبطة بالمجالات الهندسية المدنية المتعددة.', 'أن يقدم القسم المناهج الهندسية المواكبة للتطور محليا وإقليميا لخدمة المجتمع وقفا للمعاير المحلية للجودة هذا بالإضافة إلى تحقيق التميز في جودة واستدامة إعمال الهندسة المدنية بتدريب الطلاب ميدانا ومعمليا وكذلك خدمه المجتمع من خلال المساهمة في التبادل المعرفي والأنشطة المهنية وحل المشكلات البيئية المحلية من خلال مشروعات التخرج للطلاب.', '- إعداد خريج قادر على تطبيق العلوم الهندسية وأساليبها في الحياة العملية، قادر على اتخاذ القرار والتعامل مع الأزمات، متمرس بوسائل التكنولوجيا الحديثة وكيفية التعامل معها، وقادر على المنافسة في سوق العمل في ظل الظروف الجديدة والمتغيرة للمجتمع الدولي.\r\n\r\n- المساهمة في إعداد الكوادر الفنية المتخصصة في مختلف المجالات التي تقابل احتياجات المجتمع وتتطلبها مجالات التنمية الشاملة وتوفير المؤهلين في التخصصات الجديدة والمستحدثة التي يتطلبها سوق العمل.\r\n\r\n- توفير تعليم متميز يساهم في إعداد العلماء والمفكرين والمبدعين الذين يمثلون الثروة الحقيقية لتقدم المجتمع.\r\n\r\n- التطوير المستمر للبرامج الدراسية لمواكبة التقدم العلمي والتكنولوجي.\r\n\r\n-إجراء البحوث والدراسات العلمية والتطبيقية التي ترتبط بمشكلات المجتمع وبرامج التنمية في مصر.\r\n\r\n- تقديم الخبرات الاستشارية للهيئات والمؤسسات الإنتاجية وقطاع الخدمات من أجل خدمة البيئة وتنمية المجتمع.\r\n\r\n- دعم وتوثيق الروابط الثقافية والعلمية مع المؤسسات العلمية وكليات الهندسة محليا ودوليا.');

-- --------------------------------------------------------

--
-- Table structure for table `comtable`
--

CREATE TABLE `comtable` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `comtable`
--

INSERT INTO `comtable` (`id`, `text`, `img`) VALUES
(9, 'جدول امتحانات الترم الاول', '5320611503776.pdf'),
(11, 'جدول امتحانات الترم الثاني', '8619254482229.zip');

-- --------------------------------------------------------

--
-- Table structure for table `contact`
--

CREATE TABLE `contact` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `email` varchar(256) NOT NULL,
  `link` varchar(256) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `message` longtext NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `statue` int(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `depmain`
--

CREATE TABLE `depmain` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `text` varchar(5000) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `depmain`
--

INSERT INTO `depmain` (`id`, `name`, `text`, `img`) VALUES
(18, 'قسم هندسة التشييد والبناء', 'هو أحد أقسام الهندسة المدنية وهو التخطيط والإدارة وبناء المنشآت مثل الطرق السريعة والجسور والمطارات والسكك الحديدية والمباني والسدود والخزانات. ويتطلب بناء مثل هذه المشاريع الإلمام بمبادئ الهندسة، وإدارة الأعمال، والإجراءات،والاقتصاد،والسلوك الإنساني. إن من صلاحيات مهندسي التشييد تصميم المباني ذات الطابع المؤقت، وضمان ومراقبة الجودة، والتخطيط و مسح موقع التشييد، واختبار مواد التشييد في الموقع والرفع المساحي لمواقع التشييد، وتصميم خلطات الخرسانة، وتقدير التكاليف والتخطيط والجدولة، وهندسة السلامة، والمواد والمشتريات، واختيار المعدات، والتكاليف الهندسية ومراقبة الميزانية. تختلف هندسة التشييد عن إدارة التشييد من زاوية مستوى الرياضيات والعلوم والهندسة المستخدمة لتحليل مشاكل وعمليات التشييد.', '1631523797815.jpg'),
(19, 'هنسة الميكاترونيك', 'الميكاترونكس مصطلح يستعمل للدلالة على حقل هندسي واسع ومتشعب جداً، وهذا الحقل الهندسي يجمع بين الهندسة الميكانيكية، والهندسة الكهربائية، وهندسة الحاسوب وهندسة الإلكترونيات، ويتطور هذا التخصص بصورة مذهلة من يوم إلى آخر. هذا المجال من الهندسة يتضمن تصميم أي منتج (product) يعتمد عمله على دمج أنظمة ميكانيكية وإلكترونية، إذ يقوم بدور المنسق فيما بينها ووضع منظومة تحكم (control system) لها. ويُعرّف المعيار NF الفرنسي تحت الرقم E 01-010 الميكاترونكس على النحو التالي: &#34;النهج الذي يهدف إلى التكامل المستمر للميكانيكا والالكترونيات ونظرية التحكم، وعلوم الحاسب الآلي في تصميم المنتجات والصناعات التحويلية، من أجل تحسينه و/ أو تحسين وظائفه&#34;.', '5103703555938.jpg'),
(20, 'قسم هندسة الحاسب الآلى', 'مهندسو الحاسوب هم مهندسو إلكترونيات أساساً، ولديهم معلومات إضافية وتدريب وخبرة في مجال تصميم البرمجيات والعتاد الصلب للحاسوب، خصوصا في مجال تكامل البرمجيات مع العتاد. يشارك مهندسو الحاسوب في جميع مجالات الحوسبة من تصميم المعالجات الصغرية، والحواسيب الشخصية والحواسب الفائقة وحتى تصميم الدارات والدارات المتكاملة، بالإضافة لتكامل الأنظمة الحاسوبية مع أنواع أخرى من الأنظمة (مثل المركبات ذات المحركات والأنظمة الرقمية). [2]. يساهم مهندسو الحاسب أيضاً في كتابة الشفرات البرمجية البرمجيات المضمنة للمتحكمات الصغرية ذات الزمن الحقيقي، وتصميم الدارات المتكاملة VLSI، والعمل على الحساسات التماثلية، وتصميم أنظمة التشغيل وحتى لوحات الدارات والروبوتات.', '5371330200188.jpg'),
(21, 'الهندسة الصناعية', 'هو أحد فروع الهندسة ويهتم بالعلوم التي تخدم فن التصميم الميكانيكي وعمليات الإنتاج والتصنيع المختلفة، وكل ما يخدم ذلك في الأساس كالتخطيط والتصميم والتصنيع والتجميع والاختبار والفحص والتحليل والمعالجة والتطوير للحصول على أفضل قيمة مقابل أقل تكلفة، وهي تمسك هذه الشؤون من الجهة الاقتصادية ومن جهة التنظيم الصناعي. يعطى هذا التخصص الهندسي مسميات عدة كهندسة الدقة كما في اليابان وهندسة التصنيع أو الهندسة الصناعية', '8063455878836.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `event`
--

CREATE TABLE `event` (
  `id` int(11) NOT NULL,
  `text` varchar(3000) NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `event`
--

INSERT INTO `event` (`id`, `text`, `date`) VALUES
(1, 'امتحانات الميدترم للفصل الدراسي الاول 14 ابريل 2020', '2020-08-04'),
(2, 'امتحانات العملي للصف الدراسي الاول 22 ابريل', '2020-08-04'),
(3, 'بداية الفصل الدراسي الثاني 15 فبراير 2021', '2020-08-04'),
(4, 'انتخابات اتحاد الطلاب 14 ابريل 2022', '2020-08-04'),
(6, 'امتحانات الميدترم للفصل الدراسي الثاني 21 ابريل 2025', '2020-08-04');

-- --------------------------------------------------------

--
-- Table structure for table `first`
--

CREATE TABLE `first` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `arrangement` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `first`
--

INSERT INTO `first` (`id`, `name`, `arrangement`, `img`) VALUES
(1, 'رحمه باسم', 'المركز الاول قسم حاسب', 'default.png'),
(2, 'محمود فتحي', 'المركز الثاني قسم حاسب', '4386029483660.png'),
(3, 'مملوك', 'المركز الثالث قسم حاسب', '7943140762367.png'),
(4, 'محمود نصر', 'المركز الرابع قسم حاسب', '2204192596821.jpg'),
(5, 'ارساني اشرف', 'المركز الخامس قسم حاسب', '5571425153512.png'),
(6, 'يحيى محمد', 'المركز السادس قسم حاسب', '1760438686261.jpg'),
(7, 'بولا ويصا', 'المركز السابع قسم حاسب', '8290626707624.jpg'),
(8, 'خالد مصطفي', 'المركز الثامن قسم حاسب', '8733918764900.jpg'),
(9, 'احمد عبدالرحمن', 'المركز التاسع قسم حاسب', '5772990160546.jpg'),
(13, 'سعيد ماجد', 'المركز العاشر قسم حاسب', '1311821038435.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `global`
--

CREATE TABLE `global` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `text` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL,
  `date` date NOT NULL,
  `dateyear` varchar(256) NOT NULL,
  `datemonth` varchar(256) NOT NULL,
  `dateday` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `global`
--

INSERT INTO `global` (`id`, `name`, `text`, `img`, `date`, `dateyear`, `datemonth`, `dateday`) VALUES
(9, 'عام', 'اسماء المتقدمين للتربية العسكرية', '3407958635666.pdf', '2020-08-16', '2020', 'August', '16'),
(10, 'مستوي ثالث حاسب', 'المسجلين للمواد للفصل الدراسي الاول', '8324847551968.zip', '2020-08-16', '2020', 'August', '16'),
(11, 'مستوي خامس مدني', 'اسماء المتقدمين للتدريب الصيفي', '8928949335842.rar', '2020-08-16', '2020', 'August', '16');

-- --------------------------------------------------------

--
-- Table structure for table `indmessage`
--

CREATE TABLE `indmessage` (
  `id` int(11) NOT NULL,
  `version` longtext NOT NULL,
  `message` longtext NOT NULL,
  `aims` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `indmessage`
--

INSERT INTO `indmessage` (`id`, `version`, `message`, `aims`) VALUES
(1, 'أن يكون القسم قادرا على أمداد المجتمع بمهندسين لديهم القدرة على مواكبة التطورات و مواجهة التحديات المرتبطة بالمجالات الهندسية المدنية المتعددة.', 'أن يقدم القسم المناهج الهندسية المواكبة للتطور محليا وإقليميا لخدمة المجتمع وقفا للمعاير المحلية للجودة هذا بالإضافة إلى تحقيق التميز في جودة واستدامة إعمال الهندسة المدنية بتدريب الطلاب ميدانا ومعمليا وكذلك خدمه المجتمع من خلال المساهمة في التبادل المعرفي والأنشطة المهنية وحل المشكلات البيئية المحلية من خلال مشروعات التخرج للطلاب.', '- إعداد خريج قادر على تطبيق العلوم الهندسية وأساليبها في الحياة العملية، قادر على اتخاذ القرار والتعامل مع الأزمات، متمرس بوسائل التكنولوجيا الحديثة وكيفية التعامل معها، وقادر على المنافسة في سوق العمل في ظل الظروف الجديدة والمتغيرة للمجتمع الدولي.\r\n\r\n- المساهمة في إعداد الكوادر الفنية المتخصصة في مختلف المجالات التي تقابل احتياجات المجتمع وتتطلبها مجالات التنمية الشاملة وتوفير المؤهلين في التخصصات الجديدة والمستحدثة التي يتطلبها سوق العمل.\r\n\r\n- توفير تعليم متميز يساهم في إعداد العلماء والمفكرين والمبدعين الذين يمثلون الثروة الحقيقية لتقدم المجتمع.\r\n\r\n- التطوير المستمر للبرامج الدراسية لمواكبة التقدم العلمي والتكنولوجي.\r\n\r\n-إجراء البحوث والدراسات العلمية والتطبيقية التي ترتبط بمشكلات المجتمع وبرامج التنمية في مصر.\r\n\r\n- تقديم الخبرات الاستشارية للهيئات والمؤسسات الإنتاجية وقطاع الخدمات من أجل خدمة البيئة وتنمية المجتمع.\r\n\r\n- دعم وتوثيق الروابط الثقافية والعلمية مع المؤسسات العلمية وكليات الهندسة محليا ودوليا.');

-- --------------------------------------------------------

--
-- Table structure for table `indtable`
--

CREATE TABLE `indtable` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `indtable`
--

INSERT INTO `indtable` (`id`, `text`, `img`) VALUES
(3, 'جدول الترم الاول', '3311907329274.zip'),
(5, 'جدول الترم الثاني', '884409488544.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `lahat`
--

CREATE TABLE `lahat` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `lahat`
--

INSERT INTO `lahat` (`id`, `text`, `img`, `date`) VALUES
(7, 'اللائحة الداخلية', '936526507603.pdf', '2020-08-16'),
(10, 'اللائحة الداخلية المعدلة طبقا للإطار المرجعي 2018', '7985251183094.rar', '2020-08-16');

-- --------------------------------------------------------

--
-- Table structure for table `mainContact`
--

CREATE TABLE `mainContact` (
  `id` int(11) NOT NULL,
  `number` varchar(20) NOT NULL,
  `email` varchar(256) NOT NULL,
  `address` varchar(400) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `mainContact`
--

INSERT INTO `mainContact` (`id`, `number`, `email`, `address`) VALUES
(1, '01127554485', 'mmmnnn26161@gmail.com', 'الحي الحادي عشر - 6 اكتوبر - الجيزة');

-- --------------------------------------------------------

--
-- Table structure for table `manager`
--

CREATE TABLE `manager` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `text` varchar(3000) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `manager`
--

INSERT INTO `manager` (`id`, `name`, `text`, `img`) VALUES
(1, 'استاذ دكتور/ احمد عبدالرحمن', 'أبنائي طلاب المعهد:\r\nيسعدني أن أرحب بكم في رحاب المعهد العالي للهندسة و أتوجه للطلاب الجدد بالتهنئة القلبية للإلتحاق بالمعهد و التهنئة القلبية للطلاب القدامى بمناسبة بدء العام الدراسي الجديد آملا منهم المشاركة في حياة جامعية حافلة بالتقدم و النجاح و أنتظر منكم جميعا بذل الجهد في الدراسة و المشاركة الإيجابية في مختلف الأنشطة الطلابية و نأمل أن تسود بينكم و بين طلاب المعاهد الأخرى بمدينة الثقافة و العلوم الروح الجامعية الأصلية و أن يعطي كل واحد المثل الأعلى و القدوة الحسنة قولا و عملا و سلوكا. أسأل الله أن يوفقنا جميعا لما فيه الخير لوطننا الحبيب مصر. والسلام عليكم ورحمة الله وبركاته..... عميد المعهد14670- حدثني محمد بن الحسين قال، حدثنا أحمد بن مفضل قال، حدثنا أسباط, عن السدي: (ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقًّا فهل وجدتم ما وعد ربكم حقًّا قالوا نعم)، قال: وجد أهل الجنة ما وُعدوا من ثواب, وأهل النار ما وُعدوا من عقاب.\r\n14671- حدثني محمد بن سعد قال، حدثني أبي قال، حدثني عمي قال، حدثني أبي, عن أبيه, عن ابن عباس, قوله: (ونادى أصحاب الجنة أصحاب النار أن قد وجدنا ما وعدنا ربنا حقًّا فهل وجدتم ما وعد ربكم حقًّا)، وذلك أن ا', '1873877973593.png');

-- --------------------------------------------------------

--
-- Table structure for table `mechmessage`
--

CREATE TABLE `mechmessage` (
  `id` int(11) NOT NULL,
  `version` longtext NOT NULL,
  `message` longtext NOT NULL,
  `aims` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `mechmessage`
--

INSERT INTO `mechmessage` (`id`, `version`, `message`, `aims`) VALUES
(1, 'أن يكون القسم قادرا على أمداد المجتمع بمهندسين لديهم القدرة على مواكبة التطورات و مواجهة التحديات المرتبطة بالمجالات الهندسية المدنية المتعددة.', 'أن يقدم القسم المناهج الهندسية المواكبة للتطور محليا وإقليميا لخدمة المجتمع وقفا للمعاير المحلية للجودة هذا بالإضافة إلى تحقيق التميز في جودة واستدامة إعمال الهندسة المدنية بتدريب الطلاب ميدانا ومعمليا وكذلك خدمه المجتمع من خلال المساهمة في التبادل المعرفي والأنشطة المهنية وحل المشكلات البيئية المحلية من خلال مشروعات التخرج للطلاب.', '- إعداد خريج قادر على تطبيق العلوم الهندسية وأساليبها في الحياة العملية، قادر على اتخاذ القرار والتعامل مع الأزمات، متمرس بوسائل التكنولوجيا الحديثة وكيفية التعامل معها، وقادر على المنافسة في سوق العمل في ظل الظروف الجديدة والمتغيرة للمجتمع الدولي.\r\n\r\n- المساهمة في إعداد الكوادر الفنية المتخصصة في مختلف المجالات التي تقابل احتياجات المجتمع وتتطلبها مجالات التنمية الشاملة وتوفير المؤهلين في التخصصات الجديدة والمستحدثة التي يتطلبها سوق العمل.\r\n\r\n- توفير تعليم متميز يساهم في إعداد العلماء والمفكرين والمبدعين الذين يمثلون الثروة الحقيقية لتقدم المجتمع.\r\n\r\n- التطوير المستمر للبرامج الدراسية لمواكبة التقدم العلمي والتكنولوجي.\r\n\r\n-إجراء البحوث والدراسات العلمية والتطبيقية التي ترتبط بمشكلات المجتمع وبرامج التنمية في مصر.\r\n\r\n- تقديم الخبرات الاستشارية للهيئات والمؤسسات الإنتاجية وقطاع الخدمات من أجل خدمة البيئة وتنمية المجتمع.\r\n\r\n- دعم وتوثيق الروابط الثقافية والعلمية مع المؤسسات العلمية وكليات الهندسة محليا ودوليا.');

-- --------------------------------------------------------

--
-- Table structure for table `mechtable`
--

CREATE TABLE `mechtable` (
  `id` int(11) NOT NULL,
  `text` longtext NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `mechtable`
--

INSERT INTO `mechtable` (`id`, `text`, `img`) VALUES
(5, 'جدول امتحانات الترم الاول', '4084665347132.rar'),
(7, 'جدول امتحانات الترم الثاني', '3491515236454.pdf');

-- --------------------------------------------------------

--
-- Table structure for table `message`
--

CREATE TABLE `message` (
  `id` int(11) NOT NULL,
  `version` longtext NOT NULL,
  `message` longtext NOT NULL,
  `aims` longtext NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `message`
--

INSERT INTO `message` (`id`, `version`, `message`, `aims`) VALUES
(1, 'أن يكون المعهد العالي للهندسة بمدينة الثقافة و العلوم 6 أكتوبر واحدا من معاهد و كليات الهندسة المتميزة  والمصنفة محليا وعالميا وذلك من خلال الالتزام بالمحافظة على التميز والارتقاء بالعملية التعليمية وأعضاء هيئة التدريس والتطوير الشامل للمناهج الدراسية طبقا لرؤى واستراتيجيات المعهد العالي للهندسة .', 'المعهد العالي للهندسة على تخريج مهندسين ذوي كفاءة عالية وملتزمين بأخلاقيات المهنة ومؤهلين على مستوى عالي لتلبية احتياجات ومتطلبات سوق العمل المحلي والعالمي، ومواكبة التطورات الهندسية والتكنولوجية الحديثة، والقدرة على المشاركة الفعالة والبناءة في تنمية وتطوير المجتمع في كافة المجالات الهندسية والتقنية، كما يؤكد المعهد العالي للهندسة التزامه نحو تفعيل وتطوير البحث العلمي لتقديم أفضل الخدمات للمجتمع، وكذلك الارتقاء بالعملية التعليمية وأركانها المتمثلة في أعضاء هيئة التدريس والعاملين والطلاب والخريجين طبقا لرسالة وأهداف المعهد.\r\n301010 الغايات والأهداف الإستراتيجية \r\nيتم تحديد الغايات النهائية والأهداف الإستراتيجية بناء علي التحليل البيئي وهي :-\r\n•الغاية الأولي : جودة التعليم والتعلم .\r\n•الغاية الثانية  : جودة البحث العلمي .\r\n•الغاية الثالثة  : تطوير خدمة المجتمع وتنمية البيئة المحيطة . \r\n•الغاية الرابعة : تطوير مباني المعهد .\r\n•الغاية الخامسة: تطوير الاتصالات وتكنولوجيا المعلومات . \r\n•الغاية السادسة : تنمية الموارد البشرية .\r\n•الغاية السابعة : الإصلاح الإداري والهيكلي . \r\n•الغاية الثامنة : الاهتمام بالقيم والأخلاقيات .\r\n \r\nولتحقيق الغايات الإستراتيجية للمعهد تم تحديد أهداف إستراتيجية قابلة للتنفيذ والقياس بالتوافق مع الأهداف  والأبعاد الإستراتيجية  للمعهد والتي تتلخص في الأهداف التالية :-\r\n•الهدف الأول : رفع مستوي جودة التعليم والتعلم والعمل علي تقديم خدمة تعليمية متميزة .\r\n•الهدف الثاني : الارتقاء بالبحث العلمي .\r\n•الهدف الثالث : الاهتمام بخدمة المجتمع وتنمية البيئة المحيطة .\r\n•الهدف الرابع : تطوير وتحقيق الاستخدام الأمثل لمباني المعهد .\r\n•الهدف الخامس : تطوير الاتصالات وتكنولوجيا المعلومات .\r\n•الهدف السادس : تنمية الموارد البشرية لمواكبة الرؤية المستقبلية لإستراتيجية الجودة .\r\n•الهدف السابع: الإصلاح الإداري والهيكلي لمواكبة الرؤية الطموحة لاستراتيجيات الجودة .\r\n•الهدف الثامن : الحفاظ علي القيم والأخلاقيات التعليمية والبحثية والمهنية والإدارية .\r\nوتم عرض ومناقشة الغايات النهائية والأهداف الإستراتيجية للمعهد مع الأطراف المختلفة وتتمثل هذه الأطراف في قيادات أكاديمية ( العميد – الوكيل – رؤساء الأقسام – مدير وحدة الجودة – مديري الإدارات ) .\r\nوقد تم اعتماد الغايات النهائية والأهداف الإستراتيجية للمعهد وقد وضع المعهد آلية لمراجعة وتحديث الغايات النهائية والأهداف الإستراتيجية بشكل دوري كل خمس سنوات كحد أقصي لمواكبة التطورات المحلية والعالمية لإعداد مهندسين أكفاء لتوفير خدمة مجتمعية ترضي المستفيدين وتم اعتمادها من مجلس المعهد .', 'الهندسة هي المهنة التي تطبق فيها الخبرة العملية بالعلوم الأساسية بجانب المعرفة المكتسبة من خلال الدراسة الهندسية والخبرة والممارسة من أجل تطوير وابتكار الطرق والأساليب والآلات والأجهزة للاستخدام الأمثل لمواد وموارد وقوى الطبيعة لنفع المجتمع البشرى.\r\n\r\nلذلك يعمل المعهد من خلال أقسامه العلمية التي تغطى معظم التخصصات التي يحتاجها سوق العمل على تحقيق الأهداف الآتية :\r\n\r\nإعداد خريج قادر على تطبيق العلوم الهندسية وأساليبها في الحياة العملية، قادر على اتخاذ القرار والتعامل مع الأزمات، متمرس بوسائل التكنولوجيا الحديثة وكيفية التعامل معها، وقادر على المنافسة في سوق العمل في ظل الظروف الجديدة والمتغيرة للمجتمع الدولي.\r\n\r\nالمساهمة في إعداد الكوادر الفنية المتخصصة في مختلف المجالات التي تقابل احتياجات المجتمع وتتطلبها مجالات التنمية الشاملة وتوفير المؤهلين في التخصصات الجديدة والمستحدثة التي يتطلبها سوق العمل.\r\n\r\nتوفير تعليم متميز يساهم في إعداد العلماء والمفكرين والمبدعين الذين يمثلون الثروة الحقيقية لتقدم المجتمع.\r\n\r\nالتطوير المستمر للبرامج الدراسية لمواكبة التقدم العلمي والتكنولوجي.\r\n\r\nإجراء البحوث والدراسات العلمية والتطبيقية التي ترتبط بمشكلات المجتمع وبرامج التنمية في مصر.\r\n\r\nتقديم الخبرات الاستشارية للهيئات والمؤسسات الإنتاجية وقطاع الخدمات من أجل خدمة البيئة وتنمية المجتمع.\r\n\r\nدعم وتوثيق الروابط الثقافية والعلمية مع المؤسسات العلمية وكليات الهندسة محليا ودوليا.');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(256) NOT NULL,
  `text` varchar(5000) NOT NULL,
  `img` varchar(256) NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `title`, `text`, `img`, `date`) VALUES
(17, 'هام', 'التقديم للتسجيل في الاقسام يوم الاحد الموافق 14 ابريل 2021', 'default.jpg', '2020-08-11'),
(18, 'هام', 'تاجيل امتحانات الميدترم الي الاحد المقبل الموافق 18 اغسطس 2020', 'default.jpg', '2020-08-11'),
(19, 'عاجل', 'علي الطلاب سرعة التوجه للمعهد لانهاء اجراءات تسجيل مواد الفصل الدراسي الاول', 'default.jpg', '2020-08-11');

-- --------------------------------------------------------

--
-- Table structure for table `numbers`
--

CREATE TABLE `numbers` (
  `id` int(11) NOT NULL,
  `graduate` int(11) NOT NULL,
  `student` int(11) NOT NULL,
  `worker` int(11) NOT NULL,
  `teaching` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `numbers`
--

INSERT INTO `numbers` (`id`, `graduate`, `student`, `worker`, `teaching`) VALUES
(1, 3000, 500300, 20, 5800);

-- --------------------------------------------------------

--
-- Table structure for table `progress`
--

CREATE TABLE `progress` (
  `id` int(11) NOT NULL,
  `question` longtext NOT NULL,
  `solution` longtext NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `progress`
--

INSERT INTO `progress` (`id`, `question`, `solution`, `date`) VALUES
(5, 'ما هي الشهادات المؤهلة للمعهد بالنسبة للطلاب المصريين', '· الثانوية العامة والأزهرية القسم (العلمي) وما يعادلها من الشهادات العربية والأجنبية.\r\n\r\n· الثانوية الصناعية نظام الثلاث والخمس سنوات.', '2020-08-16'),
(6, 'ما هي شروط الالتحاق للطلاب المصريين', 'أولاً:- عن طريق مكتب التنسيق\r\nثانياً:- عن طريق التحويل\r\nأولاً: عن طريق مكتب التنسيق:-\r\n1- بالنسبة للطلاب الحاصلين على الثانوية العامة القسم (علمي)، الثانوية الأزهرية القسم (علمي)، والثانوية الصناعية نظام            الثلاث والخمس سنوات فيتم التقديم عن طريق التنسيق الإلكتروني (الإنترنت) وبعد القبول يتوجه الطالب بخطاب الترشيح          وأصول أوراقه إلى المعهد لاستكمال إجراءات قيده.\r\n\r\n2- بالنسبة للطلاب الحاصلين على الشهادات العربية والأجنبية أن يتقدم بأوراقه إلى مكتب التنسيق، وأن يكتب اسم المعهد من    ضمن رغباته ورقم طابع التنسيق الخاص بالمعهد، وفي حدود الحد الأدنى للقبول بالمعهد، والذي يتم تحديده من قبل مكتب      التنسيق، علماً بأن الأوراق المطلوبة للتقديم هي:\r\n\r\n1- أصل الثانويه + صورة منها.\r\n\r\n2- أصل شهادة الميلاد.\r\n\r\n3- 8 صور شخصية.\r\n\r\n4- نموذج 2 جند {من مديرية الامن } للطلاب الذكور.\r\n\r\n5- نموذج 6جند من القسم التابع له لمن بلغ 19عام.\r\n\r\n6- صورة بطاقة الطالب + صورة بطاقة ولى الأمر.\r\n\r\n7- إيصال كهرباء أو غاز أو تليفون لإثبات عنوان الطالب.\r\n\r\n8- بطاقة الترشيح المرشح بها الطالب على المعهد.\r\n\r\nويتم التعامل من خلال مكاتب التنسيق, ورقم المعهد بالتنسيق2/769.\r\n\r\nثانياً:- عن طريق التحويل:-\r\nعلى الطالب الذي يرغب في الالتحاق بالمعهد عن طريق التحويل أن يتقدم بأوراقه إلى إدارة القبول والتسجيل بالمعهد (( شئون الطلاب )) والتي تقوم بدورها بدراسة موقف الطالب من حيث نوع المؤهل وتاريخه والحد الأدنى ومدى أحقية الطالب في القبول بالمعهد من عدمه.\r\n\r\nالأوراق المطلوبة للطالب الراغب فى التحويل:-\r\nبيان حالة بالتسلسل الدراسي من المعهد أو الكلية المراد التحويل منها.\r\n\r\nصورة ضوئية من المؤهل الدراسي.', '2020-08-16'),
(7, 'ما هي الشهادات المؤهلة للمعهد بالنسبة للطلاب غير المصريين', '· الثانوية العامة والأزهرية القسم (العلمي) وما يعادلها من الشهادات العربية والأجنبية.\r\n\r\n· الثانوية الصناعية نظام الثلاث والخمس سنوات.', '2020-08-16'),
(8, 'ما هي شروط الالتحاق للطلاب غير المصريين', 'يتم التحاق الطلاب غير المصريين ( الوافدين ) عن طريق الموقع الإلكتروني الخاص بإدارة الوافدين بوزارة التعليم العالي المصرية www.mohe-casm.edu.eg\r\n\r\nملحوظة:\r\nيقبل الطالب بإدارة الوافدين بصرف النظر عن تاريخ المؤهل، فلا يشترط حداثة المؤهل', '2020-08-16'),
(9, 'ما هي الاوراق المطلوبة', '1- أصل المؤهل الدراسي موثق من الدولة الوافد منها الطالب.\r\n\r\n2- أصل شهادة الميلاد موثق من الدولة الوافد منها الطالب.\r\n\r\n3- 6صور شخصية.\r\n\r\n4- صورة ضوئية كاملة من جواز سفر الطالب.\r\n\r\n5- خطاب الملحقية الثقافية بقبول التحاق الطالب بالمعهد.\r\n\r\n6- الإقرارات الخاصة بالطالب موثق من الدولة الوافد منها الطالب', '2020-08-16');

-- --------------------------------------------------------

--
-- Table structure for table `question`
--

CREATE TABLE `question` (
  `id` int(11) NOT NULL,
  `question` longtext NOT NULL,
  `solution` longtext NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `result`
--

CREATE TABLE `result` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `text` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp(),
  `dateyear` varchar(256) NOT NULL,
  `datemonth` varchar(256) NOT NULL,
  `dateday` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `result`
--

INSERT INTO `result` (`id`, `name`, `text`, `img`, `date`, `dateyear`, `datemonth`, `dateday`) VALUES
(15, 'مستوي تاني حاسب', 'نتيجة الترم الثاني', '5607294674380.pdf', '2020-08-16', '2020', 'August', '16'),
(16, 'مستوي تالت حاسب', 'نتيجة الترم الاول', '7110738497067.rar', '2020-08-16', '2020', 'August', '16'),
(18, 'مستوي خامس مدني', 'نتيجة الميدترم الاول', '5880686999488.zip', '2020-08-16', '2020', 'August', '16');

-- --------------------------------------------------------

--
-- Table structure for table `service`
--

CREATE TABLE `service` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `link` varchar(1000) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `service`
--

INSERT INTO `service` (`id`, `name`, `link`, `img`) VALUES
(19, 'بنك المعرفة', 'http://www.ekb.eg/ar/web/students/home', '1055012554998.png'),
(20, 'النتيجة', '', '5968053619851.png'),
(21, 'اتصل بنا', '', '5280361189081.png'),
(22, 'اتحاد الطلاب', '', '4881100329129.jpeg'),
(23, 'جداول الامتحانات', '', '7471310548956.png');

-- --------------------------------------------------------

--
-- Table structure for table `setting`
--

CREATE TABLE `setting` (
  `id` int(11) NOT NULL,
  `title` varchar(256) NOT NULL,
  `description` mediumtext NOT NULL,
  `staute` int(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `setting`
--

INSERT INTO `setting` (`id`, `title`, `description`, `staute`) VALUES
(1, 'المعهد العالي للهندسة', 'السلام عليكم ورحمة الله وصلي الله علي سيدنا محمد', 1);

-- --------------------------------------------------------

--
-- Table structure for table `slider`
--

CREATE TABLE `slider` (
  `id` int(11) NOT NULL,
  `text` varchar(3000) NOT NULL,
  `img` varchar(3500) NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `slider`
--

INSERT INTO `slider` (`id`, `text`, `img`, `date`) VALUES
(1, 'المعهد العالي للهندسة', '9489493145786.jpg', '2020-08-02'),
(2, 'أسرة المعهد العالي للهندسة', '5166829290063.jpg', '2020-08-02'),
(3, 'أسرة المعهد العالي للهندسة تهنئ م. مازن الحريري\r\nلمناقشته رساله الماجيستير', '4717579423432.jpg', '2020-08-02'),
(4, 'أسرة المعهد العالي للهندسة تهنئ م. ايمان صبري\r\nلمناقشة رسالة الدكتوراه', '1805292983390.jpg', '2020-08-02');

-- --------------------------------------------------------

--
-- Table structure for table `social`
--

CREATE TABLE `social` (
  `id` int(11) NOT NULL,
  `facebook` varchar(500) NOT NULL,
  `twitter` varchar(500) NOT NULL,
  `youtube` varchar(500) NOT NULL,
  `instagram` varchar(500) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `social`
--

INSERT INTO `social` (`id`, `facebook`, `twitter`, `youtube`, `instagram`) VALUES
(1, 'https://www.facebook.com/', 'zzzzzzzzzzzzzzzzzzzzzzz', 'https://www.yallakora.com/', '');

-- --------------------------------------------------------

--
-- Table structure for table `techass`
--

CREATE TABLE `techass` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `room` varchar(256) NOT NULL,
  `face` varchar(256) NOT NULL,
  `insta` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `techass`
--

INSERT INTO `techass` (`id`, `name`, `room`, `face`, `insta`, `img`) VALUES
(15, 'mahmoud  Nasr Gomaa', '170', '', '', '3695331952389.png'),
(19, 'Ahmed Nasr', '120', '', '', '895191904375.png'),
(25, 'mahmoud  Nasr Gomaa', '120', '', '', '9576368204431.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `techdoctor`
--

CREATE TABLE `techdoctor` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `room` varchar(256) NOT NULL,
  `face` varchar(256) NOT NULL,
  `insta` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `techdoctor`
--

INSERT INTO `techdoctor` (`id`, `name`, `room`, `face`, `insta`, `img`) VALUES
(16, 'mahmoud nasr', '120', '', '', '1495402066493.png'),
(17, 'محمود جمعة', '550', '', '', 'tech.png'),
(18, 'mahmoud', '402', '', '', '8609833867136.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `techmanager`
--

CREATE TABLE `techmanager` (
  `id` int(11) NOT NULL,
  `name` varchar(256) NOT NULL,
  `room` varchar(256) NOT NULL,
  `face` varchar(256) NOT NULL,
  `insta` varchar(256) NOT NULL,
  `img` varchar(256) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `techmanager`
--

INSERT INTO `techmanager` (`id`, `name`, `room`, `face`, `insta`, `img`) VALUES
(25, 'Ahmed Nasr', '120', '', '', '7306973858251.png'),
(26, 'Ahmed', '210', 'https://www.farescd.com/', '', 'tech.png');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `about`
--
ALTER TABLE `about`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aboutcivil`
--
ALTER TABLE `aboutcivil`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aboutcom`
--
ALTER TABLE `aboutcom`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aboutind`
--
ALTER TABLE `aboutind`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `aboutmech`
--
ALTER TABLE `aboutmech`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `activity`
--
ALTER TABLE `activity`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `civilmessage`
--
ALTER TABLE `civilmessage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `civiltable`
--
ALTER TABLE `civiltable`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`comment_id`);

--
-- Indexes for table `commessage`
--
ALTER TABLE `commessage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comtable`
--
ALTER TABLE `comtable`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `depmain`
--
ALTER TABLE `depmain`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `first`
--
ALTER TABLE `first`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `global`
--
ALTER TABLE `global`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `indmessage`
--
ALTER TABLE `indmessage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `indtable`
--
ALTER TABLE `indtable`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lahat`
--
ALTER TABLE `lahat`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mainContact`
--
ALTER TABLE `mainContact`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `manager`
--
ALTER TABLE `manager`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mechmessage`
--
ALTER TABLE `mechmessage`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `mechtable`
--
ALTER TABLE `mechtable`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `numbers`
--
ALTER TABLE `numbers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `progress`
--
ALTER TABLE `progress`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question`
--
ALTER TABLE `question`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `result`
--
ALTER TABLE `result`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `service`
--
ALTER TABLE `service`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `setting`
--
ALTER TABLE `setting`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `slider`
--
ALTER TABLE `slider`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `social`
--
ALTER TABLE `social`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `techass`
--
ALTER TABLE `techass`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `techdoctor`
--
ALTER TABLE `techdoctor`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `techmanager`
--
ALTER TABLE `techmanager`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `about`
--
ALTER TABLE `about`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aboutcivil`
--
ALTER TABLE `aboutcivil`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aboutcom`
--
ALTER TABLE `aboutcom`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aboutind`
--
ALTER TABLE `aboutind`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `aboutmech`
--
ALTER TABLE `aboutmech`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `activity`
--
ALTER TABLE `activity`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT for table `civilmessage`
--
ALTER TABLE `civilmessage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `civiltable`
--
ALTER TABLE `civiltable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `commessage`
--
ALTER TABLE `commessage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `comtable`
--
ALTER TABLE `comtable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `contact`
--
ALTER TABLE `contact`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=173;

--
-- AUTO_INCREMENT for table `depmain`
--
ALTER TABLE `depmain`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `event`
--
ALTER TABLE `event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `first`
--
ALTER TABLE `first`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `global`
--
ALTER TABLE `global`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `indmessage`
--
ALTER TABLE `indmessage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `indtable`
--
ALTER TABLE `indtable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `lahat`
--
ALTER TABLE `lahat`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `mainContact`
--
ALTER TABLE `mainContact`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `manager`
--
ALTER TABLE `manager`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `mechmessage`
--
ALTER TABLE `mechmessage`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `mechtable`
--
ALTER TABLE `mechtable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `numbers`
--
ALTER TABLE `numbers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `progress`
--
ALTER TABLE `progress`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `question`
--
ALTER TABLE `question`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `result`
--
ALTER TABLE `result`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `service`
--
ALTER TABLE `service`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT for table `setting`
--
ALTER TABLE `setting`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `slider`
--
ALTER TABLE `slider`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `social`
--
ALTER TABLE `social`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `techass`
--
ALTER TABLE `techass`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `techdoctor`
--
ALTER TABLE `techdoctor`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `techmanager`
--
ALTER TABLE `techmanager`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
